Documents/ОбзвонКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбзвонКлиентов</Name>
			<Comment>Обзвон клиентов для контроля качества монтажей, по акциям</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОпроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбзвоновКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросОпроса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОбзвонКлиентов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Выполнено = Ложь;
		Объект.ДатаВыполнения = Неопределено;
		Объект.ОтветственныйВыполнения = Неопределено;
		
		ПерезаполнитьТелефоныКонтрагента();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// перенесено в ПерезаполнитьТелефоныКонтрагента()
	//СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКИ, "ВыполнитьИсходящийЗвонок_Основной");
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПерезаполнитьТелефоныКонтрагента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	
	ИндексСтроки = Число(СтрЗаменить(Команда.Имя, "ВыполнитьИсходящийЗвонокКонтактнаяИнформацияПолеТелефон", ""));
	ТелефонКлиента = ТаблицаКИ[ИндексСтроки-1].Представление;
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, ТелефонКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ВидОпросаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ВидОпроса) И Объект.Вопросы.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполнении", ЭтаФорма, Параметры), "Изменился вид опроса. Перезаполнить вопросы?", РежимДиалогаВопрос.ДаНет,,,,);
	Иначе
		ЗаполнитьВопросыПоВидуОпроса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполнении(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Вопросы.Очистить();
		ЗаполнитьВопросыПоВидуОпроса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВопросыПоВидуОпроса()
	Документы.ОбзвонКлиентов.ЗаполнитьВопросыПоВидуОпроса(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВыполненоПриИзменении(Элемент)
	Если Объект.Выполнено И НЕ ЗначениеЗаполнено(Объект.ДатаВыполнения) Тогда
		Объект.ДатаВыполнения = ТекущаяДата();
		Объект.ОтветственныйВыполнения = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьВариантОтвета(СсылкаВопрос)
	Возврат ?(ЗначениеЗаполнено(СсылкаВопрос.ВариантОтвета), СсылкаВопрос.ВариантОтвета, 2);
КонецФункции

&НаКлиенте
Процедура ВопросыПриАктивизацииЯчейки(Элемент)
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Булево"));
	ОписаниеТиповБулево = Новый ОписаниеТипов(Массив);
	
	Если Элементы.Вопросы.ТекущиеДанные <> Неопределено И Элемент.ТекущийЭлемент.Имя = "ВопросыОтвет" Тогда
		
		ВариантОтвета = ПолучитьВариантОтвета(Элементы.Вопросы.ТекущиеДанные.Вопрос);
		Если ВариантОтвета = 1 Тогда
			Элемент.ТекущийЭлемент.ОграничениеТипа = ОписаниеТиповБулево;
		ИначеЕсли ВариантОтвета = 2 Тогда
			Элемент.ТекущийЭлемент.ОграничениеТипа = ОписаниеТиповСтрока;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МонтажПриИзменении(Элемент)
	МонтажПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МонтажПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) тогда
		Объект.Контрагент = Объект.Монтаж.Контрагент;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ПерезаполнитьТелефоныКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ОсновнойТелефонКлиента()
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
КонецФункции

&НаСервере
Процедура ПерезаполнитьТелефоныКонтрагента()
	
	//Телефон = ОсновнойТелефонКлиента();
	
	// удаляем 
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого СтрокаКИ Из ТаблицаКИ Цикл
		МассивУдаляемыхРеквизитов.Добавить(СтрокаКИ.ИмяРеквизита);
		
        НайденныйЭлементФормы = Элементы.Найти(СтрокаКИ.ИмяРеквизита);
        Если НайденныйЭлементФормы <> Неопределено  Тогда
            Элементы.Удалить(НайденныйЭлементФормы);
		КонецЕсли;
		НайденныйЭлементФормы = Элементы.Найти("ВыполнитьИсходящийЗвонок" + СтрокаКИ.ИмяРеквизита);
        Если НайденныйЭлементФормы <> Неопределено  Тогда
            Элементы.Удалить(НайденныйЭлементФормы);
		КонецЕсли;		
		НайденныйЭлементФормы = Элементы.Найти("Группа" + СтрокаКИ.ИмяРеквизита);
        Если НайденныйЭлементФормы <> Неопределено  Тогда
            Элементы.Удалить(НайденныйЭлементФормы);
		КонецЕсли;
		
		НайденнаяКоманда = Команды.Найти("ВыполнитьИсходящийЗвонок" + СтрокаКИ.ИмяРеквизита);
		Если НайденнаяКоманда <> Неопределено Тогда
            Команды.Удалить(НайденнаяКоманда);
		КонецЕсли;
	КонецЦикла;
	Если МассивУдаляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	КонецЕсли;
	
	ТаблицаКИ.Очистить();
	
	// добавляем
	МассивДобавляемыхРеквизитов = Новый Массив;
	Строка500 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	КонтактнаяИнформация = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2",
						"КонтактнаяИнформацияПолеТелефон",
						СтрокаКИ.НомерСтроки);
					
		//ПутьРеквизитов = ИмяРеквизита;				
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, Строка500, , "Телефон", Ложь));
		
		НоваяСтрока = ТаблицаКИ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИ);
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	КонецЦикла;	
	
	// Добавим новые реквизиты формы
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	Для Каждого СтрокаКИ Из ТаблицаКИ Цикл
		ЭтаФорма[СтрокаКИ.ИмяРеквизита] = СтрокаКИ.Представление;
		ГруппаЭлемента = Элементы.Добавить("Группа" + СтрокаКИ.ИмяРеквизита, Тип("ГруппаФормы"), Элементы.ГруппаКИ);
		ГруппаЭлемента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЭлемента.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаЭлемента.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаЭлемента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
		Элемент = Элементы.Добавить(СтрокаКИ.ИмяРеквизита, Тип("ПолеФормы"), ГруппаЭлемента);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = СтрокаКИ.ИмяРеквизита;
		Элемент.ТолькоПросмотр = Истина;
		
		СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект, ГруппаЭлемента, СтрокаКИ.ИмяРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры
